// Задача 1. Вывести квадрат числа

Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine());

int result = number * number;

Console.Write("Квадрат числа равен: ");
Console.WriteLine(result);